openfoam_cases/losses-mass/reEval/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices        
(
    (0    0    0)    //0
    (0.3  0    0)    //1
    (0.3  0.3  0)    //2
    (0    0.3  0)    //3
    (0    0    0.3)  //4
    (0.3  0    0.3)  //5
    (0.3  0.3  0.3)  //6
    (0    0.3  0.3)  //7
);

blocks          
(
    hex (0 1 2 3 4 5 6 7)  (75 75 75) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
);

mergePatchPairs 
(
);

// ************************************************************************* //
