openfoam_cases/losses-mass/reEval/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "wall|fixedWalls|topOPatch"  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet  
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -10;
        value           uniform (0 0 0);
    }
    "outlet.*"
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            symmetry;
    }
    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
